# BuiltInFailures.ForeignFileFailures Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuiltInFailures..::..ForeignFileFailures Members
BuiltInFailures..::..ForeignFileFailures Class Properties See Also
---
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures..::..ForeignFileFailures type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ForeignFile | This file [FamilyName] was saved by an application that was not developed or licensed by Autodesk. |
| ForeignLink | This file [RvtLinkName] was saved by an application that was not developed or licensed by Autodesk. |

# See Also
BuiltInFailures..::..ForeignFileFailures Class
Autodesk.Revit.DB Namespace